# Задание № 1
#def my_del(a, b):
#    res = a / b
#    #print(res)
#    return res
#try:
#    print(my_del(int(input('Введите число а: ')), int(input('Введите число b: '))))
#except ZeroDivisionError:
#    print('На ноль делить нельзя!')

# Задание № 2
def team_member(name, last_name, year_of_birth, city, email, phone_number):
    res = (name, last_name, year_of_birth, city, email, phone_number)
    return res
print(team_member(input('Имя: '), input('Фамилия: '), int(input('Год рождения: ')), input('Город проживания: '), input('email: '), int(input('Номер телефона: '))))
#

last_name = input('Фамилия: '),
#year_of_birth = input('Год рождения: ')
#city = input('Город проживания: ')
#email = input('email: ')
#phone_number = input('Номер телефона: ')
#print(team_member(input('Имя: ')))


 #   res = (name, last_name, year_of_birth, city, email, phone_number)
  #  return res
#print(team_member)

# Задание № 3
my_func()
